.config/emacs/config.org
#+title: MG's Emacs
#+author: Moritz Gleissner (MG)
#+description: Personal config that was build from the ground up
#+startup: showeverything
#+options: toc:2

* Table Of Contents :toc:
- [[#variables][Variables]]
- [[#important-programs-to-load-first][Important Programs To Load First]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
- [[#ace-jump][Ace Jump]]
- [[#backup][Backup]]
- [[#beacon-mode][Beacon Mode]]
- [[#buffer-move][Buffer Move]]
- [[#company][Company]]
- [[#color-identifiers][Color Identifiers]]
- [[#dashboard][Dashboard]]
- [[#dired][Dired]]
- [[#diminish][Diminish]]
- [[#dimmer][Dimmer]]
- [[#editor-config][Editor Config]]
- [[#fonts][Fonts]]
  - [[#zooming-inout][Zooming In/Out]]
- [[#flycheck][Flycheck]]
- [[#flyspell][Flyspell]]
- [[#git-programs][Git Programs]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
  - [[#forge][Forge]]
- [[#highlight-todo][Highlight TODO]]
- [[#highlight-indent-guids][Highlight Indent Guids]]
- [[#icons][Icons]]
- [[#ivy][Ivy]]
- [[#tree-sitter][Tree Sitter]]
- [[#language-support][Language Support]]
- [[#language-server-protokoll][Language Server Protokoll]]
- [[#mu4e][Mu4e]]
- [[#mini-buffer-escape][Mini-buffer Escape]]
- [[#modeline][Modeline]]
- [[#mouse-center-cursor][Mouse Center Cursor]]
- [[#neotree][Neotree]]
- [[#org-mode][Org Mode]]
  - [[#org-caldav][Org CalDav]]
  - [[#tangle-auto][Tangle auto]]
  - [[#org-appear][Org-Appear]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#hide-markup-elements][Hide Markup Elements]]
  - [[#diminish-org-indent-mode][Diminish Org Indent Mode]]
  - [[#org-level-headers][Org Level Headers]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#perspective][Perspective]]
- [[#pretty-symboles][Pretty Symboles]]
- [[#projectile][Projectile]]
- [[#rainbow-delimiters][Rainbow Delimiters]]
- [[#rainbow-mode][Rainbow Mode]]
- [[#sane-defaults][Sane defaults]]
- [[#shells-and-terminals][Shells And Terminals]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
  - [[#vterm-toggle][Vterm-Toggle]]
- [[#sudo-edit][Sudo edit]]
- [[#themes][Themes]]
- [[#tldr][TLDR]]
- [[#transparency][Transparency]]
- [[#undoredo][Undo/Redo]]
- [[#which-key][Which-Key]]
- [[#yasnippet][YASnippet]]

* Variables
#+begin_src emacs-lisp
(setq Home '"~/.config/emacs/")
#+end_src

* Important Programs To Load First
** Elpaca Package Manager
[[https://github.com/progfolio/elpaca][Elpaca]] is an elisp package manager. It allows users to find, install, update, and remove third-party packages for Emacs. It is a replacement for the built-in Emacs package manager, package.el.

#+begin_src emacs-lisp
;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable :elpaca use-package keyword.
  (elpaca-use-package-mode)
  ;; Assume :elpaca t unless otherwise specified.
  (setq elpaca-use-package-by-default t))

;; Block until current queue processed.
(elpaca-wait)

;;When installing a package which modifies a form used at the top-level
;;(e.g. a package which adds a use-package key word),
;;use `elpaca-wait to block until that package has been installed/configured.
;;For example:
;;(use-package general :demand t)
;;(elpaca-wait)

;; Expands to: (elpaca evil (use-package evil :demand t))
;; (use-package evil :demand t)

;;Turns off elpaca-use-package-mode current declartion
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
(use-package emacs
  :elpaca nil
  :config
  (setq ring-bell-function #'ignore))

;; Dont install anything. Defer execution of BODY
;;(elpaca nil (message "deferred"))
#+end_src

** Load Evil Mode
[[https://github.com/emacs-evil/evil][Evil]] is an extensible vi layer for Emacs. It emulates the main features of Vim, and provides facilities for writing custom extensions. Also see our page on Emacs Wiki.

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (setq evil-undo-system 'undo-fu)
  (evil-mode))
(use-package evil-collection
  :after evil
  :config
  ;; (setq evil-collection-mode-list '(calendar dashboard dired ediff info magit ibuffer))
  (evil-collection-init))
(use-package evil-tutor)
;; Using RETURN to follow links in Org/Evil
;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))
;; Setting RETURN key in org-mode to follow links
(setq org-return-follows-link  t)
#+end_src

