.config/emacs/config.org
* Language Server Protokoll
Client for Language Server Protocol (v3.14). lsp-mode aims to provide IDE-like experience by providing optional integration with the most popular Emacs packages like company, flycheck and projectile.
#+begin_src emacs-lisp
(use-package lsp-bridge
  :elpaca '(lsp-bridge :type git :host github :repo "manateelazycat/lsp-bridge"
            :files (:defaults "*.el" "*.py" "acm" "core" "langserver" "multiserver" "resources")
            :build (:not compile))
  :init
  (global-lsp-bridge-mode)
  :config
  (setq lsp-bridge-user-multiserver-dir (concat Home "lsp-multiserver-conf")
	lsp-bridge-find-def-select-in-open-windows t
	lsp-bridge-enable-hover-diagnostic t
	lsp-bridge-enable-org-babel t
	lsp-bridge-enable-with-tramp t
	lsp-bridge-peek-file-content-height 16
	lsp-bridge-peek-file-content-scroll-margin 3
	acm-enable-tabnine nil
	acm-enable-codeium nil
	acm-enable-copilot t
	acm-enable-preview t
	lsp-bridge-python-lsp-server 'pylsp
	lsp-bridge-c-lsp-server 'ccls
)
  ;; hides the modeline in lsp box buffers
  (add-to-list 'auto-mode-alist '("\\*acm-buffer*\\'" . hide-mode-line))
  (add-to-list 'auto-mode-alist '("\\*acm-doc-buffer*\\'" . hide-mode-line))
)


;; (use-package lsp-mode
;;   :init
;;   ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
;;   (setq lsp-keymap-prefix "C-c l")
;;   :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
;;          ;;(prog-mode . lsp)
;;          (web-mode . lsp)
;;          (json-mode . lsp)
;;          (vue-mode . lsp)
;;          ;; if you want which-key integration
;;          (lsp-mode . lsp-enable-which-key-integration))
;;   :commands lsp)
;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
;; (use-package lsp-ui :commands lsp-ui-mode)
;; ;; The flycheck does not work in typescript, html and javascript blocks in vue-mode. How to fix that?
;; (with-eval-after-load 'lsp-mode
;;   (mapc #'lsp-flycheck-add-mode '(typescript-mode js-mode css-mode vue-html-mode)))
;; ;; performance changes
(setq read-process-output-max (* 1024 1024)) ;; 1mb
;; (setq lsp-idle-delay 0.500)  ;; This variable determines how often lsp-mode will refresh the highlights, lenses, links, etc while you type
(setq gc-cons-threshold 100000000)
#+end_src

* Mu4e
#+begin_src emacs-lisp
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
(require 'mu4e)
(setq user-mail-address "moritz@gleissner.de")
(use-package mu4easy
  :bind ("C-c u" . mu4e)
  :config 
  (add-hook 'elpaca-after-init-hook #'mu4easy-mode)
  (mu4easy-mode)
  :custom
  (mu4easy-contexts
	'((mu4easy-context
           :c-name  "Ionos"
           :maildir "Ionos"
           :mail    "moritz@gleissner.de"
           :smtp    "smtp.ionos.de"))))
#+end_src


* Mini-buffer Escape
By default, Emacs requires you to hit ESC three times to escape quit the minibuffer.

#+begin_src emacs-lisp
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src

* Modeline
The modeline is the bottom status bar that appears in Emacs windows.  While you can create your own custom modeline, why go to the trouble when Doom Emacs already has a nice modeline package available.  For more information on what is available to configure in the Doom modeline, check out: [[https://github.com/seagle0128/doom-modeline][Doom Modeline]]

#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :config
  (setq doom-modeline-height 35      ;; sets modeline height
        doom-modeline-bar-width 5    ;; sets right bar width
	  doom-modeline-icon t         ;; Whether display icons in the mode-line
	  doom-modeline-major-mode-icon t  ;; Whether display the icon for `major-mode'
	  doom-modeline-major-mode-color-icon t
	  doom-modeline-buffer-state-icon t  ;; Whether display the icon for the buffer state
	  doom-modeline-buffer-modification-icon t  ;; Whether display the modification icon for the buffer
	  doom-modeline-time-icon t    ;; Whether display the time icon
	  doom-modeline-buffer-name t  ;; Whether display the buffer name
	  doom-modeline-buffer-encoding t  ;; Whether display the buffer encoding
	  doom-modeline-indent-info t  ;; Whether display the indentation information
	  doom-modeline-display-default-persp-name t  ;; If non nil the default perspective name is displayed in the mode-line
        doom-modeline-persp-name t   ;; adds perspective name to modeline
        doom-modeline-persp-icon t   ;; adds folder icon next to persp name
	  doom-modeline-lsp t          ;; Whether display the `lsp' state
	  doom-modeline-modal t        ;; Including `evil', `overwrite', `god', `ryo' and `xah-fly-keys', etc
	  doom-modeline-modal-icon t   ;; Including `evil', `overwrite', `god', `ryo' and `xah-fly-keys', etc
	  doom-modeline-modal-modern-icon t  ;; Whether display the modern icons for modals
	  doom-modeline-gnus t         ;; Whether display the gnus notifications
	  doom-modeline-gnus-timer 2   ;; Whether gnus should automatically be updated and how often (set to 0 or smaller than 0 to disable)
	  doom-modeline-time t         ;; Whether display the time
	  doom-modeline-env-version t  ;; Whether display the environment version
))
(use-package hide-mode-line)
#+end_src

* Mouse Center Cursor
Moves the page and not the cursor
#+begin_src emacs-lisp
(use-package centered-cursor-mode
  :demand
  :config
  ;; Optional, enables centered-cursor-mode in all buffers.
  (global-centered-cursor-mode)
  (setq ccm-recenter-at-end-of-file t))
#+end_src

* Neotree
Neotree is a file tree viewer.  When you open neotree, it jumps to the current file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the neotree width be adjustable.  NeoTree provides following themes: classic, ascii, arrow, icons, and nerd.  Theme can be configed by setting "two" themes for neo-theme: one for the GUI and one for the terminal.  I like to use 'SPC t' for 'toggle' keybindings, so I have used 'SPC t n' for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp
(use-package neotree
  :after doom-themes
  :config
  (setq neo-smart-open nil
        neo-show-hidden-files t
        neo-window-width 40
        neo-window-fixed-size nil
        inhibit-compacting-font-caches t
	  neo-theme (if (display-graphic-p) 'nerd 'arrow))
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))
#+end_src

* Org Mode

#+begin_src emacs-lisp
(setq org-log-done 'time)  ;; marks done todos with close time
(setq org-agenda-files '("~/NextCloud/Documents/Org/Agenda/"))
(use-package org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode))
#+end_src

** Org CalDav

#+begin_src emacs-lisp
(use-package org-caldav
  :config
  (setq org-caldav-url "https://cloud.gleissner.com/remote.php/dav/calendars/moritz"
	org-caldav-calendar-id "org"
	org-icalendar-timezone "Europe/Berlin"))
(use-package calfw)
(use-package calfw-org
  :after calfw)
(use-package calfw-cal)
#+end_src

** Tangle auto

#+begin_src emacs-lisp
;; to tangle on save
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src

** Org-Appear
Org mode provides a way to toggle visibility of hidden elements such as emphasis markers, links, etc. by customizing specific variables

#+begin_src emacs-lisp
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t))
#+end_src

** Enabling Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enabling Org Bullets
Org-bullets gives us attractive bullets rather than asterisks.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** Hide Markup Elements 
There are plenty structural markup elements in org-mode like *bold* or /italic/, but they are visible in the org-mode text, which is good, if the file is intended for export, and bad, if it is intended for semi-WYSIWYG editing. I want to hide these markup symbols, so the *bold* becomes bold, just like links hide their square brackets.
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src

** Diminish Org Indent Mode
Removes "Ind" from showing in the modeline.

#+begin_src emacs-lisp
(eval-after-load 'org-indent '(diminish 'org-indent-mode))
#+end_src

** Org Level Headers
#+begin_src emacs-lisp
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.7))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.6))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.5))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.4))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.3))))
   '(org-level-6 ((t (:inherit outline-5 :height 1.2))))
   '(org-level-7 ((t (:inherit outline-5 :height 1.1)))))
#+end_src

